![Join](cover/13.%20Join%20Function.png)

### Outline
* Join Operation
* Methods
    - left
    - right
    - outer
    - inner
* Suffix
    - lsuffix
    - rsuffix

### What is Join?

Join means combining two tables by matching their rows.

![join](cover/Join.png)

In [1]:
#import pandas library
import pandas as pd

#### Create a two DataFrame

In [2]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
                 'B': [11, 12, 13, 14, 15, 16, 17, 18, 19, 20]})

df1

    A   B
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [3]:
df2 = pd.DataFrame({'C': [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000],
                 'D': [111, 121, 131, 141, 151, 161, 171, 181, 191, 201]})

df2

      C    D
0   100  111
1   200  121
2   300  131
3   400  141
4   500  151
5   600  161
6   700  171
7   800  181
8   900  191
9  1000  201

### Join DataFrames

In [4]:
df1.join(df2)

    A   B     C    D
0   1  11   100  111
1   2  12   200  121
2   3  13   300  131
3   4  14   400  141
4   5  15   500  151
5   6  16   600  161
6   7  17   700  171
7   8  18   800  181
8   9  19   900  191
9  10  20  1000  201

In [5]:
df2.join(df1)

      C    D   A   B
0   100  111   1  11
1   200  121   2  12
2   300  131   3  13
3   400  141   4  14
4   500  151   5  15
5   600  161   6  16
6   700  171   7  17
7   800  181   8  18
8   900  191   9  19
9  1000  201  10  20

### how

In [6]:
df1 = pd.DataFrame({'A': [1, 2, 3],
                 'B': [11, 12, 13]})
df1

   A   B
0  1  11
1  2  12
2  3  13

In [7]:
df2 = pd.DataFrame({'C' :[4, 6, 8, 10, 12],
                    'D' :[14, 16, 18, 20, 22]})
df2

    C   D
0   4  14
1   6  16
2   8  18
3  10  20
4  12  22

<b>left join</b>: Keep all rows from the left table, and match rows from the right.

In [8]:
df1.join(df2, how= 'left')

   A   B  C   D
0  1  11  4  14
1  2  12  6  16
2  3  13  8  18

In [9]:
df1.join(df2)

   A   B  C   D
0  1  11  4  14
1  2  12  6  16
2  3  13  8  18

<b>right join</b>: Keep all rows from the right table, and match rows from the left.

In [10]:
df1.join(df2, how= 'right')

     A     B   C   D
0  1.0  11.0   4  14
1  2.0  12.0   6  16
2  3.0  13.0   8  18
3  NaN   NaN  10  20
4  NaN   NaN  12  22

<b>inner join</b>: Keep only rows that match in both tables.

In [11]:
df1.join(df2, how = 'inner')

   A   B  C   D
0  1  11  4  14
1  2  12  6  16
2  3  13  8  18

<b>outer join</b>: Keep all rows from both tables, matching where possible and filling missing values where not.

In [12]:
df1.join(df2, how='outer')

     A     B   C   D
0  1.0  11.0   4  14
1  2.0  12.0   6  16
2  3.0  13.0   8  18
3  NaN   NaN  10  20
4  NaN   NaN  12  22

### Suffix
A suffix is a small word added to the end of column names to avoid name clashes

In [14]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4, 5 ], 'B': [11, 12, 13, 14, 15 ]})
df1

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [16]:
df2= pd.DataFrame({'A': [6, 7, 8, 9, 10], 'B': [16, 17, 18, 19, 20 ]})
df2

    A   B
0   6  16
1   7  17
2   8  18
3   9  19
4  10  20

In [18]:
df1.join(df2, lsuffix= '_left', rsuffix= '_right')

   A_left  B_left  A_right  B_right
0       6      16        6       16
1       7      17        7       17
2       8      18        8       18
3       9      19        9       19
4      10      20       10       20

### For Source code:
https://sites.google.com/view/aorbtech/programming/

### @Aorb Tech